angular
    .module('App', ['dvhbMetro'])
    .controller('MainCtrl', MainCtrl);

    function MainCtrl ($scope) {

        $scope.pos = {};

        $scope.stationInfo = {};
		
		$scope.stations = {};
		
		$(".map_metro .points").each(function(e){
			var $this = $(this);
			
			$scope.stations[$this.data("metro")] = [$this.data()];
		});


        $scope.allStations = {
            "Замоскворецкая": ["Речной вокзал", "Водный стадион", "Войковская", "Сокол", "Аэропорт", "Динамо", "Белорусская", "Тверская", "Театральная", "Новокузнецкая", "Павелецкая", "Автозаводская", "Технопарк", "Коломенская", "Каширская", "Кантемировская", "Царицыно", "Орехово", "Домодедовская", "Красногвардейская", "Алма-Атинская"],
            "Таганско-Краснопресненская линия": ["Планерная", "Сходненская", "Тушинская", "Спартак", "Щукинская", "Октябрьское Поле", "Полежаевская", "Беговая", "Улица 1905 года", "Баррикандая", "Пушкинская", "Кузнецкий Мост", "Китай-город", "Таганская", "Пролетарская", "Волгоградский проспект", "Текстильщики", "Кузьминки", "Рязанский проспект", "Выхино", "Лермонтовский проспект", "Жулебино", "Котельники"],
            "Арбатско-Покровская": ["Пятницкое шоссе", "Митино", "Волоколамская", "Мякинино", "Строгино", "Крылатское", "Молодёжная", "Кунцевская", "Славянский бульвар", "Парк Победы", "Киевская", "Смоленская", "Арбатская", "Площадь Революции", "Курская", "Бауманская", "Электрозаводская", "Семёновская", "Партизанская", "Измайловская", "Первомайская", "Щёлковская"],
            "Филёвская": ["Пионерская", "Филёвский парк", "Багратионовская", "Фили", "Кутузовская", "Студенческая", "Выставочная", "Международная", "Киевская", "Смоленская", "Арбатская", "Александровский сад"],
            "Сокольническая": ["Саларьево", "Румянцево", "Тропарёво", "Юго-Западная", "Проспект Вернадского", "Университет", "Воробьёвы горы", "Спортивная", "Фрунзенская", "Кропоткинская", "Библиотека им. Ленина", "Охотный Ряд", "Лубянка", "Чистые пруды", "Красные Ворота", "Комсомольская", "Красносельская", "Сокольники", "Преображенская площадь", "Черкизовская", "Бульвар Рокоссовского"],
            "Кольцевая": ["Октябрьская", "Добрынинская", "Павелецкая", "Таганская", "Курская", "Комсомольская", "Проспект Мира", "Менделеевская", "Белорусская", "Краснопресненская"],
            "Калужско-Рижская": ["Новоясеневская", "Ясенево", "Тёплый стан", "Коньково", "Беляево", "Калужская", "Новые Черёмушки", "Профсоюзная", "Академическая", "Ленинский проспект", "Шаболовская", "Октябрьская", "Третьяковская", "Китай-город", "Тургеневская", "Сухаревская", "Проспект Мира", "Рижская", "Алексеевская", "Ботанический сад", "Свиблово", "Бабушкинская", "Медведково"],
            "Калининско-Солнцевская 1": ["Новокосино", "Новогиреево", "Перово", "Шоссе Энтузиастов", "Авиамоторная", "Площадь Ильича", "Марксистская", "Новокузнецкая"],
            "Калининско-Солнцевская 2": ["Парк Победы", "Деловой центр"],
            "Серпуховско-Тимерязевская": ["Алтуфьево", "Бибирево", "Отрадное", "Владыкино", "Петровско-Разумовская", "Тимирязевская", "Дмитровская", "Савёловская", "Менделеевская", "Трубная", "Чеховская", "Александровский сад", "Полянка", "Серпуховская", "Тульская", "Нагатинская", "Нагорная", "Нахимовский проспект", "Севастопольская", "Чертановская", "Южная", "Пражская", "Улица Академика Янгеля", "Аннино", "Бульвар Дмитрия Донского"],
            "Люблинско-Дмитровская": ["Зябликово", "Шипиловская", "Борисово", "Марьино", "Братиславская", "Люблино", "Волжская", "Печатники", "Кожуховская", "Дубровка", "Крестьянская Застава", "Римская", "Чкаловская", "Сретенский бульвар", "Трубная", "Достоевская", "Марьина Роща"], 
            "Каховская": ["Каховская", "Варшавская", "Каширская"],
            "Бутовская": ["Бунинская аллея", "Улица Горчакова", "Бульвар Адмирала Ушакова", "Улица Скобелевская", "Улица Старокачаловская", "Лесопарковая", "Битцевский парк"]
        };


        $scope.showInfo = function (names, position) {
          $scope.station = {
            name: names[0], 
            info: $scope.stations[names[0]]
          };
        }

    }  